Documents/РазмещениеПоЯчейкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РазмещениеПоЯчейкам</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтПокупателя</xr:Item>
				<xr:Item>Document.ОприходованиеТоваров</xr:Item>
				<xr:Item>Document.КорректировкаРеализации</xr:Item>
				<xr:Item>Document.ПересортицаТоваров</xr:Item>
				<xr:Item>Document.ЗаданиеНаИнвентаризацию</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровНаОтветственноеХранение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПалетноеХранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПослеПриемки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаОтветственноеХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаИнвентаризацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроверять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клеверенс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УжеРазмещены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВведеноВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыПриемки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПриемки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПроверкеВЧЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиЧЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНайденВЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступилНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбратитеВнимание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НазваниеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НазваниеБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Альметьевск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Владимир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воронеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воронеж2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Восток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казань2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Калуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Киров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краснодар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краснодар2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Липецк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Молодогвардейская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НабережныеЧелны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НижнийНовгород</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пенза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятигорск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростов2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рязань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Саранск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Север</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тамбов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тверь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тула</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ульяновск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чебоксары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шахты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮГ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ярославль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПересортицаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПересортицаТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СписанныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходоватьТоварыПоСебестоимостиСписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РазмещениеПоЯчейкам/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

Процедура ОбновитьСтатусПоступления(Учитывать = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыДокумента.Номенклатура,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ Поступление
	|ИЗ
	|	Документ." + СокрЛП(ДокументОснование.Метаданные().Имя) + ".Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументОснование
	|	И ТоварыДокумента.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкамТовары.Номенклатура,
	|	СУММА(РазмещениеПоЯчейкамТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ Размещено
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.Проведен
	|	И РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = &ДокументОснование
	|	И ВЫБОР
	|			КОГДА &Учитывать
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ РазмещениеПоЯчейкамТовары.Ссылка = &Ссылка
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкамТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Поступление.Номенклатура,
	|	СУММА(Поступление.Количество - ЕСТЬNULL(Размещено.Количество, 0)) КАК Количество
	|ИЗ
	|	Поступление КАК Поступление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Размещено КАК Размещено
	|		ПО Поступление.Номенклатура = Размещено.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	Поступление.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(Поступление.Количество - ЕСТЬNULL(Размещено.Количество, 0)) > 0";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Учитывать", Учитывать);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Статус = ?(Выборка.Количество() = 0, Перечисления.СтатусыПриемки.Завершено, Перечисления.СтатусыПриемки.Обработка);
	КоличествоСтрок = " (строк: " + Выборка.Количество() + ")";
	
	//+Белов А. 07.05.2025 #UT10-5225
	МСКWEB.УстановитьЗначениеДопСвойства(ДокументОснование, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Статус);
	МСКWEB.УстановитьЗначениеДопСвойства(ДокументОснование, ПланыВидовХарактеристик.СвойстваОбъектов.КоличествоСтрок, КоличествоСтрок);
	//МЗ = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	//МЗ.Объект = ДокументОснование;
	//МЗ.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки;
	//МЗ.Значение = Статус;
	//МЗ.Записать();
	//
	//МЗ = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	//МЗ.Объект = ДокументОснование;
	//МЗ.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.КоличествоСтрок;
	//МЗ.Значение = КоличествоСтрок;
	//МЗ.Записать();   
	//-Белов А. 07.05.2025 #UT10-5225

	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		Если ДанныеЗаполнения.Проведен = Ложь Тогда
			#Если Клиент Тогда
				Предупреждение("Документ основание НЕ ПРОВЕДЕН!
				|Создание документа не возможно!", 20);
			#КонецЕсли
			
			СтандартнаяОбработка = Ложь;
			Возврат;
			
		КонецЕсли;
		
		// Заполнение шапки
		Склад = ДанныеЗаполнения.СкладОрдер;
		ДокументОснование = ДанныеЗаполнения;  
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
		|	ПоступлениеТоваровУслугТовары.ГМ
		|ПОМЕСТИТЬ ТаблицаПТУ
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка = &ПТУ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугТовары.Номенклатура,
		|	ПоступлениеТоваровУслугТовары.ГМ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыВЯчейкахОбороты.Номенклатура КАК Номенклатура,
		|	СУММА(ТоварыВЯчейкахОбороты.КоличествоОборот) КАК КоличествоОборот,
		|	ТоварыВЯчейкахОбороты.ГМ
		|ПОМЕСТИТЬ ТаблРазмещение
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					ТаблицаПТУ.Номенклатура
		|				ИЗ
		|					ТаблицаПТУ КАК ТаблицаПТУ)) КАК ТоварыВЯчейкахОбороты
		|ГДЕ
		|	ТоварыВЯчейкахОбороты.Регистратор.ДокументОснование = &ПТУ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейкахОбороты.Номенклатура,
		|	ТоварыВЯчейкахОбороты.ГМ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПТУ.Номенклатура КАК Номенклатура,
		|	СУММА(ТаблицаПТУ.Количество - ЕСТЬNULL(ТаблРазмещение.КоличествоОборот, 0)) КАК ЕстьРасхождения,
		|	ТаблицаПТУ.ГМ
		|ПОМЕСТИТЬ ТаблицаИтог
		|ИЗ
		|	ТаблицаПТУ КАК ТаблицаПТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблРазмещение КАК ТаблРазмещение
		|		ПО ТаблицаПТУ.Номенклатура = ТаблРазмещение.Номенклатура
		|			И ТаблицаПТУ.ГМ = ТаблРазмещение.ГМ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПТУ.Номенклатура,
		|	ТаблицаПТУ.ГМ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИтог.Номенклатура КАК Номенклатура,
		|	ТаблицаИтог.ЕстьРасхождения КАК Количество,
		|	ТаблицаИтог.ГМ
		|ИЗ
		|	ТаблицаИтог КАК ТаблицаИтог
		|ГДЕ
		|	ТаблицаИтог.ЕстьРасхождения > 0";
		
		Запрос.УстановитьПараметр("ПТУ", ДанныеЗаполнения);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		Результат.Колонки.Добавить("Родитель");
		
		Для каждого ТекСтр Из Результат Цикл
			ТекСтр.Родитель = ТекСтр.Номенклатура.Родитель;
		КонецЦикла;
		
		Результат.Сортировать("Родитель,Номенклатура");
		
		ЯчейкаДляЗаполнения = Справочники.Ячейки.ПустаяСсылка();
		
		Если ДанныеЗаполнения.Экспресс Тогда
			ЯчейкаДляЗаполнения = Константы.ЯчейкаЭкспресс.Получить();
		КонецЕсли;
		
		Для каждого ТекСтр Из Результат Цикл
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекСтр.Номенклатура;
			НоваяСтрока.Количество = ТекСтр.Количество;
			НоваяСтрока.Ячейка = ЯчейкаДляЗаполнения;
			
			НоваяСтрока.ГМ = ТекСтр.ГМ;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		
		ДатаПерехода = Константы.ДатаОкончанияПроведенияПоЯчейкамДокументомОприходованияТоваровВоронеж.Получить();
		
		Если Константы.База.Получить() = Перечисления.НазваниеБазы.Воронеж И ДанныеЗаполнения.Дата < ДатаПерехода Тогда 
			
			#Если Клиент Тогда
				Предупреждение("Внимание! Документ 'Размещение по ячейкам' на основании
				|документа 'Оприходование товаров' создается
				|только для документов, созданных не ранее " + Формат(ДатаПерехода,"ДФ=dd.MM.yyyy")+"!", 20);
			#КонецЕсли
			
			ДокументОснование = ДанныеЗаполнения;
			Возврат;
			
		КонецЕсли;
		
		Склад = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения;
		
		Для каждого ТекСтр Из ДанныеЗаполнения.Товары Цикл
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекСтр.Номенклатура;
			НоваяСтрока.Количество = ТекСтр.Количество;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда 
		
		ДатаПерехода = Константы.ДатаОтказаИспользованияРазмещенияПоЯчейкам.Получить();
		
		Если ДанныеЗаполнения.Дата> ДатаПерехода Тогда 
			
			#Если Клиент Тогда
				Предупреждение("Внимание! Документ 'Размещение по ячейкам' на основании
				|документа 'Возврат товаров от покупателя' создается
				|только до " + Формат(ДатаПерехода, "ДФ=dd.MM.yyyy") + "!", 20);
			#КонецЕсли
			
			ДокументОснование = ДанныеЗаполнения;
			Возврат;
			
		Иначе
			
			Если ДанныеЗаполнения.Проведен = Ложь Тогда
				
				#Если Клиент Тогда
					Предупреждение("Документ основание НЕ ПРОВЕДЕН!
					|Создание документа невозможно!", 20);
				#КонецЕсли
				
				СтандартнаяОбработка = Ложь;
				Возврат;
				
			КонецЕсли;
			
			// Заполнение шапки
			Склад = ДанныеЗаполнения.СкладОрдер;
			ДокументОснование = ДанныеЗаполнения;
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Номенклатура,
			|	СУММА(ВозвратТоваровОтПокупателяТовары.Количество) КАК Количество
			|ИЗ
			|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
			|ГДЕ
			|	ВозвратТоваровОтПокупателяТовары.Ссылка = &Ссылка
			|	И ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен = ИСТИНА
			|
			|СГРУППИРОВАТЬ ПО
			|	ВозвратТоваровОтПокупателяТовары.Номенклатура";
			
			Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			Результат.Колонки.Добавить("Родитель");
			
			Для каждого ТекСтр Из Результат Цикл
				ТекСтр.Родитель = ТекСтр.Номенклатура.Родитель;
			КонецЦикла;
			
			Результат.Сортировать("Родитель,Номенклатура");
			
			Для каждого ТекСтр Из Результат Цикл
				
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = ТекСтр.Номенклатура;
				НоваяСтрока.Количество = ТекСтр.Количество;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Если ДанныеЗаполнения.Проведен = Ложь Тогда
			
			#Если Клиент Тогда
				Предупреждение("Документ основание НЕ ПРОВЕДЕН!
				|Создание документа не возможно!", 20);
			#КонецЕсли
			
			СтандартнаяОбработка = Ложь;
			Возврат;
			
		КонецЕсли;
		
		ДокументОснование = ДанныеЗаполнения;
		Склад = Константы.ОсновнойСклад.Получить();
		
		Для Каждого ТекСтр из ДанныеЗаполнения.Товары Цикл
			
			Если ТекСтр.Количество <> ТекСтр.КоличествоДоИзменения Тогда
				
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = ТекСтр.Номенклатура;
				НоваяСтрока.Количество = ТекСтр.КоличествоДоИзменения - ТекСтр.Количество;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересортицаТоваров") Тогда
		
		Если ДанныеЗаполнения.Проведен = Ложь Тогда
			
			#Если Клиент Тогда
				Предупреждение("Документ основание НЕ ПРОВЕДЕН!
				|Создание документа не возможно!", 20);
			#КонецЕсли
			
			СтандартнаяОбработка = Ложь;
			Возврат;
			
		КонецЕсли;
		
		Склад = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПересортицаТоваровТовары.НоменклатураОприходование КАК Номенклатура,
		|	СУММА(ПересортицаТоваровТовары.Количество) КАК Количество,
		|	ПересортицаТоваровТовары.Номенклатура.Родитель КАК НоменклатураРодитель
		|ИЗ
		|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
		|ГДЕ
		|	ПересортицаТоваровТовары.Ссылка = &Ссылка
		|	И ПересортицаТоваровТовары.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ПересортицаТоваровТовары.НоменклатураОприходование,
		|	ПересортицаТоваровТовары.Номенклатура.Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураРодитель,
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтр Из Результат Цикл
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекСтр.Номенклатура;
			НоваяСтрока.Количество = ТекСтр.Количество;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровНаОтветственноеХранение") Тогда
		
		Если ДанныеЗаполнения.Проведен = Ложь Тогда 
			
			#Если Клиент Тогда
				Предупреждение("Документ основание НЕ ПРОВЕДЕН!
				|Создание документа не возможно!", 20);
			#КонецЕсли
			
			СтандартнаяОбработка = Ложь;
			Возврат;
			
		КонецЕсли;
		
		Склад = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения;
		
		Запрос = Новый Запрос;
		Запрос.Текст =  
		//+Гавриленков В. 05.02.2025 #UT10-5086
		//"ВЫБРАТЬ
		//|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура КАК Номенклатура,
		//|	СУММА(ПоступлениеТоваровНаОтветственноеХранениеТовары.Количество) КАК Количество,
		//|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура.Родитель КАК НоменклатураРодитель
		//|ИЗ
		//|	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
		//|ГДЕ
		//|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка = &Ссылка
		//|	И ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка.Проведен = ИСТИНА
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура,
		//|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура.Родитель		
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НоменклатураРодитель,
		//|	Номенклатура 		
		//|АВТОУПОРЯДОЧИВАНИЕ"; 
		
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ПоступлениеТоваровНаОтветственноеХранениеТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ТаблицаПТОХ
		|ИЗ
		|	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
		|ГДЕ
		|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка = &ПТОХ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыВЯчейкахОбороты.Номенклатура КАК Номенклатура,
		|	СУММА(ТоварыВЯчейкахОбороты.КоличествоОборот) КАК КоличествоОборот
		|ПОМЕСТИТЬ ТаблРазмещение
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					ТаблицаПТОХ.Номенклатура
		|				ИЗ
		|					ТаблицаПТОХ КАК ТаблицаПТОХ)) КАК ТоварыВЯчейкахОбороты
		|ГДЕ
		|	ТоварыВЯчейкахОбороты.Регистратор.ДокументОснование = &ПТОХ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейкахОбороты.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПТОХ.Номенклатура КАК Номенклатура,
		|	СУММА(ТаблицаПТОХ.Количество - ЕСТЬNULL(ТаблРазмещение.КоличествоОборот, 0)) КАК ЕстьРасхождения
		|ПОМЕСТИТЬ ТаблицаИтог
		|ИЗ
		|	ТаблицаПТОХ КАК ТаблицаПТОХ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблРазмещение КАК ТаблРазмещение
		|		ПО ТаблицаПТОХ.Номенклатура = ТаблРазмещение.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПТОХ.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИтог.Номенклатура КАК Номенклатура,
		|	ТаблицаИтог.ЕстьРасхождения КАК Количество
		|ИЗ
		|	ТаблицаИтог КАК ТаблицаИтог
		|ГДЕ
		|	ТаблицаИтог.ЕстьРасхождения > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаИтог.Номенклатура.Родитель
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ПТОХ", ДанныеЗаполнения);
		//-Гавриленков В. 05.02.2025 #UT10-5086
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтр Из Результат Цикл 
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекСтр.Номенклатура;
			НоваяСтрока.Количество = ТекСтр.Количество;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Товары.Количество()> 0 Тогда
		
		ФильтрПоНоменклатуре = Товары.ВыгрузитьКолонку("Номенклатура");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
		|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Номенклатура В (&Номенклатура)) КАК ТоварыВЯчейкахОстатки
		|ИТОГИ
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Номенклатура,
		|	Ячейка";
		
		Запрос.УстановитьПараметр("Номенклатура", ФильтрПоНоменклатуре);
		
		Результат = Запрос.Выполнить();
		ВыборкаНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			Номенклатура = ВыборкаНоменклатура.Номенклатура;
			ВыборкаЯчейка = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Текст = "";
			
			Пока ВыборкаЯчейка.Следующий() Цикл				
				Текст = Текст + ВыборкаЯчейка.Ячейка + "(" + ВыборкаЯчейка.КоличествоОстаток + ");";				
			КонецЦикла;
			
			Текст = Лев(Текст,СтрДлина(Текст) - 1);
			Строка = Товары.Найти(Номенклатура);
			
			Если Строка <> Неопределено Тогда 
				Строка.УжеРазмещены = Текст;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Не НеПроверять Тогда
		
		Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
			
			Сообщить("Документ создан НЕ НА Оновании. Проведение запрещено!", СтатусСообщения.ОченьВажное);
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		Если НЕ ДокументОснование.Проведен Тогда
			
			Сообщить("Документ основание : " + ДокументОснование.Ссылка + " НЕ ПРОВЕДЕН!", СтатусСообщения.ОченьВажное);
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Движения.ТоварыВЯчейках.Записывать = Истина;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда	
		
		Если НЕ Клеверенс Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПоступлениеТоваровУслугТовары.Номенклатура,
			|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
			|	ПоступлениеТоваровУслугТовары.ГМ
			|ПОМЕСТИТЬ ТаблицаПТУ
			|ИЗ
			|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			|ГДЕ
			|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ПоступлениеТоваровУслугТовары.Номенклатура,
			|	ПоступлениеТоваровУслугТовары.ГМ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(РазмещениеПоЯчейкамТовары.Количество) КАК КоличествоОборот,
			|	РазмещениеПоЯчейкамТовары.Номенклатура,
			|	РазмещениеПоЯчейкамТовары.ГМ
			|ПОМЕСТИТЬ ТаблРазмещение
			|ИЗ
			|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
			|ГДЕ
			|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = &Ссылка
			|	И РазмещениеПоЯчейкамТовары.Ссылка.Проведен
			|	И РазмещениеПоЯчейкамТовары.Ссылка <> &ТекущееРазмещение
			|
			|СГРУППИРОВАТЬ ПО
			|	РазмещениеПоЯчейкамТовары.ГМ,
			|	РазмещениеПоЯчейкамТовары.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаПТУ.Номенклатура,
			|	СУММА(ТаблицаПТУ.Количество - ЕСТЬNULL(ТаблРазмещение.КоличествоОборот, 0)) КАК ЕстьРасхождения,
			|	ТаблицаПТУ.ГМ
			|ПОМЕСТИТЬ ТаблицаИтог
			|ИЗ
			|	ТаблицаПТУ КАК ТаблицаПТУ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблРазмещение КАК ТаблРазмещение
			|		ПО ТаблицаПТУ.Номенклатура = ТаблРазмещение.Номенклатура
			|			И ТаблицаПТУ.ГМ = ТаблРазмещение.ГМ
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаПТУ.Номенклатура,
			|	ТаблицаПТУ.ГМ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаИтог.Номенклатура КАК Номенклатура,
			|	ТаблицаИтог.ЕстьРасхождения КАК Количество,
			|	ТаблицаИтог.ГМ
			|ИЗ
			|	ТаблицаИтог КАК ТаблицаИтог
			|ГДЕ
			|	ТаблицаИтог.ЕстьРасхождения > 0";
			
			Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
			Запрос.УстановитьПараметр("ТекущееРазмещение", Ссылка);
			
			КоличествоВПоступлении = Запрос.Выполнить().Выгрузить();
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РазмещениеПоЯчейкамТовары.Номенклатура КАК Номенклатура,
			|	СУММА(РазмещениеПоЯчейкамТовары.Количество) КАК Количество,
			|	РазмещениеПоЯчейкамТовары.ГМ КАК ГМ
			|ИЗ
			|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
			|ГДЕ
			|	РазмещениеПоЯчейкамТовары.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	РазмещениеПоЯчейкамТовары.ГМ,
			|	РазмещениеПоЯчейкамТовары.Номенклатура
			|ИТОГИ
			|	СУММА(Количество)
			|ПО
			|	Номенклатура,
			|	ГМ";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			Результат = Запрос.Выполнить();
			
			ВыборкаНоменклатуры = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаНоменклатуры.Следующий() Цикл
				
				Выборка = ВыборкаНоменклатуры.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					СтрокиПоиска = КоличествоВПоступлении.НайтиСтроки(Новый Структура("Номенклатура, ГМ", Выборка.Номенклатура, Выборка.ГМ));
					
					Если СтрокиПоиска.Количество() = 0 Тогда
						
						Сообщить("Номенклатуры : " + Выборка.Номенклатура + " нет в документе ""Поступление"" и здесь", СтатусСообщения.ОченьВажное);
						Отказ = Истина;
						
					Иначе 
						
						Строка = СтрокиПоиска[0];
						
						Если Строка.Количество <> Выборка.Количество Тогда
							
							Сообщить("Для номенклатуры : " + Выборка.Номенклатура + " разное количество в документе ""Поступление"" и здесь", СтатусСообщения.ОченьВажное);
							Отказ = Истина;
							
						КонецЕсли;
						
					КонецЕсли;			
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		
		// Общее количество должно совпадать с документом поступление
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ВозвратТоваровОтПокупателяТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|ГДЕ
		|	ВозвратТоваровОтПокупателяТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратТоваровОтПокупателяТовары.Номенклатура";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		КоличествоВПоступлении = Запрос.Выполнить().Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмещениеПоЯчейкамТовары.Номенклатура КАК Номенклатура,
		|	РазмещениеПоЯчейкамТовары.Количество КАК Количество
		|ИЗ
		|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
		|ГДЕ
		|	РазмещениеПоЯчейкамТовары.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Номенклатура";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		
		Пока Выборка.Следующий() Цикл
			
			Строка = КоличествоВПоступлении.Найти(Выборка.Номенклатура,"Номенклатура");
			
			Если Строка = Неопределено Тогда
				
				Сообщить("Номенклатуры : " + Выборка.Номенклатура + " нет в документе ""Поступление"" и здесь", СтатусСообщения.ОченьВажное);
				Отказ = Истина;
				
			Иначе
				
				Если Строка.Количество <> Выборка.Количество Тогда
					
					Сообщить("Для номенклатуры : " + Выборка.Номенклатура + " разное количество в документе ""Поступление"" и здесь", СтатусСообщения.ОченьВажное);
					Отказ = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПересортицаТоваров") Тогда
		
		ЯчейкаДоВыяснения = Константы.ЯчейкаДоВыяснения.Получить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПересортицаТоваровТовары.Ссылка.Склад,
		|	ПересортицаТоваровТовары.Номенклатура,
		|	СУММА(ПересортицаТоваровТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ НоменклатураКСписанию
		|ИЗ
		|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
		|ГДЕ
		|	ПересортицаТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПересортицаТоваровТовары.Ссылка.Склад,
		|	ПересортицаТоваровТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураКСписанию.Склад,
		|	НоменклатураКСписанию.Номенклатура,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - НоменклатураКСписанию.Количество КАК Количество,
		|	НоменклатураКСписанию.Количество КАК Требуется,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) КАК ВНаличии
		|ИЗ
		|	НоменклатураКСписанию КАК НоменклатураКСписанию
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
		|				&МоментДокумента,
		|				Ячейка = &ЯчейкаДоВыяснения
		|					И (Номенклатура, Склад) В
		|						(ВЫБРАТЬ
		|							НоменклатураКСписанию.Номенклатура,
		|							НоменклатураКСписанию.Склад
		|						ИЗ
		|							НоменклатураКСписанию КАК НоменклатураКСписанию)) КАК ТоварыВЯчейкахОстатки
		|		ПО НоменклатураКСписанию.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|			И НоменклатураКСписанию.Склад = ТоварыВЯчейкахОстатки.Склад
		|ГДЕ
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - НоменклатураКСписанию.Количество < 0
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураКСписанию.Склад,
		|	НоменклатураКСписанию.Номенклатура,
		|	НоменклатураКСписанию.Количество
		|ИЗ
		|	НоменклатураКСписанию КАК НоменклатураКСписанию";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
		Запрос.УстановитьПараметр("ЯчейкаДоВыяснения", ЯчейкаДоВыяснения);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		НедостаточноПозиций = РезультатЗапроса[1].Выгрузить();
		СписатьНоменклатуру = РезультатЗапроса[2].Выгрузить();
		
		Для Каждого ТекСтр Из НедостаточноПозиций Цикл
			
			Отказ = Истина;
			Сообщить("В ячейке 'ДО ВОСТРЕБОВАНИЯ' (" + ЯчейкаДоВыяснения + ") на складе " + ТекСтр.Склад + " недостаточно товара " + ТекСтр.Номенклатура +
			". Требуется :" + ТекСтр.Требуется + ", в наличии : " + ТекСтр.ВНаличии ,СтатусСообщения.ОченьВажное);
			
		КонецЦикла;
		
		// Общее количество должно совпадать с документом основания
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПересортицаТоваровТовары.НоменклатураОприходование КАК Номенклатура,
		|	СУММА(ПересортицаТоваровТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
		|ГДЕ
		|	ПересортицаТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПересортицаТоваровТовары.НоменклатураОприходование";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		КоличествоВПоступлении = Запрос.Выполнить().Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмещениеПоЯчейкамТовары.Номенклатура КАК Номенклатура,
		|	РазмещениеПоЯчейкамТовары.Количество КАК Количество
		|ИЗ
		|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
		|ГДЕ
		|	РазмещениеПоЯчейкамТовары.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Номенклатура";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			
			Строка = КоличествоВПоступлении.Найти(Выборка.Номенклатура, "Номенклатура");
			
			Если Строка = Неопределено Тогда
				
				Сообщить("Номенклатуры : " + Выборка.Номенклатура + " нет в документе ""Пересортица товаров"" и здесь", СтатусСообщения.ОченьВажное);
				Отказ = Истина;
				
			Иначе 
				
				Если Строка.Количество <> Выборка.Количество Тогда
					
					Сообщить("Для номенклатуры : " + Выборка.Номенклатура + " разное количество в документе ""Пересортица товаров"" и здесь", СтатусСообщения.ОченьВажное);
					Отказ = Истина;
					
				КонецЕсли;
				
			КонецЕсли;	 
			
		КонецЦикла;
		
		Если НЕ Отказ Тогда	
			
			Для Каждого ТекСтр Из СписатьНоменклатуру Цикл	
				
				Движение = Движения.ТоварыВЯчейках.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Склад = ТекСтр.Склад;
				Движение.Номенклатура = ТекСтр.Номенклатура;
				Движение.Ячейка = ЯчейкаДоВыяснения;
				Движение.Количество = ТекСтр.Количество;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			
			Если ТекСтрокаТовары.Количество = 0 Тогда
				
				Сообщить("Не задано количество в строке : " + ТекСтрокаТовары.НомерСтроки, СтатусСообщения.ОченьВажное);
				Отказ = Истина;
				
			КонецЕсли;
			
			Движение = Движения.ТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Ячейка = ТекСтрокаТовары.Ячейка;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.ГМ = ТекСтрокаТовары.ГМ;
			
		КонецЦикла;
		
	КонецЕсли;	
	
	
	Если ЗначениеЗаполнено(ДокументОснование) И НЕ ДокументОснование.Метаданные().Реквизиты.Найти("НомерСкладскогоДокумента") = Неопределено Тогда
		ОбновитьСтатусПоступления();
	КонецЕсли;
	
	//+Кабанов А.В. 05.09.2025 # UT10-5361
	//Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") И ДокументОснование.Экспресс И ДокументОснование.Проведен Тогда 
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") И ДокументОснование.Проведен И (ДокументОснование.Экспресс ИЛИ ДокументОснование.ОтсканированныеКодыМаркировки.Количество() > 0)Тогда 
	//-Кабанов А.В. 05.09.2025 # UT10-5361
	
		УстановитьПривилегированныйРежим(Истина);
		
		Попытка 
			
			Движения.Записать();
			ОснованиеОбект = ДокументОснование.ПолучитьОбъект();
			ОснованиеОбект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			
		Исключение
			
		КонецПопытки;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) 
	
	Если НЕ ДокументОснование.Метаданные().Реквизиты.Найти("НомерСкладскогоДокумента") = Неопределено Тогда
		ОбновитьСтатусПоступления(Ложь);
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") И ДокументОснование.Экспресс И ДокументОснование.Проведен Тогда
		
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
		УстановитьПривилегированныйРежим(Истина);
		
		Попытка
			
			ОснованиеОбект = ДокументОснование.ПолучитьОбъект();
			ОснованиеОбект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			
		Исключение
			
		КонецПопытки;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	ДатаПерехода = Константы.ДатаОтказаИспользованияРазмещенияПоЯчейкам.Получить();
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") И
		Дата > ДатаПерехода Тогда
		
		#Если Клиент Тогда
			Предупреждение("Внимание! Документ 'Размещение по ячейкам' на основании
			|документа 'Возврат товаров от покупателя' можно записать и провести
			|только до " + Формат(ДатаПерехода,"ДФ=dd.MM.yyyy") + "!", 20);
		#КонецЕсли
		
		Отказ = Истина;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			НомерСкладскогоДокумента = ДокументОснование.НомерСкладскогоДокумента;
		Иначе
			НомерСкладскогоДокумента = "";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
